---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.TextureRealWorldOffsetZ
source: html/ae907aa3-3aa4-f758-d75d-ce49e88fc131.htm
---
# Autodesk.Revit.DB.Visual.Wave.TextureRealWorldOffsetZ Property

The property labeled "Offset Z" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetZ { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".